In [1]:
import pandas as pd

In [10]:
df1 = pd.DataFrame([[1,75,3],[5,22,7],[5,38,7]],columns=['A','B','C'])
df1

   A   B  C
0  1  75  3
1  5  22  7
2  5  38  7

In [11]:
df2 = pd.DataFrame([[11,22,33],[54,75,76],[57,38,79]],columns=['X','Y','Z'])
df2

    X   Y   Z
0  11  22  33
1  54  75  76
2  57  38  79

In [13]:
df3 = pd.merge(df2,df1,right_on='B',left_on='Y')  #whatever you want to make same write on right_on and left_on which you can change and merge

In [9]:
df3

   A   B  C   X   Y   Z
0  1  75  3  54  75  76
1  5  22  7  11  22  33
2  5  38  7  57  38  79

In [15]:
df3 = pd.merge(df2,df1,left)

NameError: name 'left' is not defined

In [18]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [20]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [21]:
pd.merge(df1,df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  bar        2  bar        6
3  baz        3  baz        7
4  foo        5  foo        5
5  foo        5  foo        8

In [22]:
pd.merge(df1,df2, left_on='lkey', right_on='rkey',
          suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  bar           2  bar            6
3  baz           3  baz            7
4  foo           5  foo            5
5  foo           5  foo            8

In [25]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_False', '_1False'))

  lkey  value_False rkey  value_1False
0  foo            1  foo             5
1  foo            1  foo             8
2  bar            2  bar             6
3  baz            3  baz             7
4  foo            5  foo             5
5  foo            5  foo             8

In [47]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo','baz'],'c':[1,4]})

In [48]:
df1

     a  b
0  foo  1
1  bar  2

In [49]:
df2

     a  c
0  foo  1
1  baz  4

In [50]:
df1.merge(df2, how='inner', on='a')

     a  b  c
0  foo  1  1

In [52]:
df1.merge(df2, how='right', on='a')

     a    b  c
0  foo  1.0  1
1  baz  NaN  4

In [53]:
df1.merge(df2, how='left', on='a')

     a  b    c
0  foo  1  1.0
1  bar  2  NaN

In [54]:
df1.merge(df2, how='cross')

   a_x  b  a_y  c
0  foo  1  foo  1
1  foo  1  baz  4
2  bar  2  foo  1
3  bar  2  baz  4